<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>Binder机制学习 | Hexo|王祖亮</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="1.What&amp;#xFF1F;
Binder&amp;#x662F;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF1F;Binder&amp;#x662F;Android&amp;#x7CFB;&amp;#x7EDF;&amp;#x4E2D;&amp;#x7684;&amp;#x4E00;&amp;#x79CD;&amp;#x8FDB;&amp;#x7A0B;&amp;#x95F4;&amp;#x901A;&amp;#x8BAF;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3">
<meta property="og:type" content="article">
<meta property="og:title" content="Binder机制学习">
<meta property="og:url" content="http://yoursite.com/2016/12/04/Binder机制学习/index.html">
<meta property="og:site_name" content="Hexo|王祖亮">
<meta property="og:description" content="1.What&amp;#xFF1F;
Binder&amp;#x662F;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF1F;Binder&amp;#x662F;Android&amp;#x7CFB;&amp;#x7EDF;&amp;#x4E2D;&amp;#x7684;&amp;#x4E00;&amp;#x79CD;&amp;#x8FDB;&amp;#x7A0B;&amp;#x95F4;&amp;#x901A;&amp;#x8BAF;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3">
<meta property="og:updated_time" content="2017-02-26T06:56:08.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Binder机制学习">
<meta name="twitter:description" content="1.What&amp;#xFF1F;
Binder&amp;#x662F;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF1F;Binder&amp;#x662F;Android&amp;#x7CFB;&amp;#x7EDF;&amp;#x4E2D;&amp;#x7684;&amp;#x4E00;&amp;#x79CD;&amp;#x8FDB;&amp;#x7A0B;&amp;#x95F4;&amp;#x901A;&amp;#x8BAF;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3">
  
    <link rel="alternative" href="/atom.xml" title="Hexo|王祖亮" type="application/atom+xml">
  
  
    <link rel="icon" href="/32.png">
  
  <link rel="stylesheet" href="/css/style.css" type="text/css">
</head>
<body>
  <div id="container">
    <div class="left-col">
    <div class="overlay"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img lazy-src="/img/touxiang.jpg" class="js-avatar">
			
		</a>

		<hgroup>
		  <h1 class="header-author"><a href="/">王祖亮</a></h1>
		</hgroup>

		
		<p class="header-subtitle">一只码畜</p>
		

		
			<div class="switch-btn">
				<div class="icon">
					<div class="icon-ctn">
						<div class="icon-wrap icon-house" data-idx="0">
							<div class="birdhouse"></div>
							<div class="birdhouse_holes"></div>
						</div>
						<div class="icon-wrap icon-ribbon hide" data-idx="1">
							<div class="ribbon"></div>
						</div>
						
						
						<div class="icon-wrap icon-me hide" data-idx="3">
							<div class="user"></div>
							<div class="shoulder"></div>
						</div>
						
					</div>
					
				</div>
				<div class="tips-box hide">
					<div class="tips-arrow"></div>
					<ul class="tips-inner">
						<li>菜单</li>
						<li>标签</li>
						
						
						<li>关于我</li>
						
					</ul>
				</div>
			</div>
		

		<div class="switch-area">
			<div class="switch-wrap">
				<section class="switch-part switch-part1">
					<nav class="header-menu">
						<ul>
						
							<li><a href="/">主页</a></li>
				        
							<li><a href="/archives">所有文章</a></li>
				        
						</ul>
					</nav>
					<nav class="header-nav">
						<div class="social">
							
								<a class="github" target="_blank" href="https://github.com/ZuLiangWang" title="github">github</a>
					        
						</div>
					</nav>
				</section>
				
				
				<section class="switch-part switch-part2">
					<div class="widget tagcloud" id="js-tagcloud">
						<a href="/tags/Android/" style="font-size: 20px;">Android</a> <a href="/tags/Gradle-Android/" style="font-size: 10px;">Gradle Android</a> <a href="/tags/Java/" style="font-size: 10px;">Java</a> <a href="/tags/Linux/" style="font-size: 13.33px;">Linux</a> <a href="/tags/OpenGL/" style="font-size: 10px;">OpenGL</a> <a href="/tags/复习笔记/" style="font-size: 13.33px;">复习笔记</a> <a href="/tags/实习-share/" style="font-size: 10px;">实习 share</a> <a href="/tags/杂/" style="font-size: 16.67px;">杂</a> <a href="/tags/课程/" style="font-size: 10px;">课程</a>
					</div>
				</section>
				
				
				

				
				
				<section class="switch-part switch-part3">
				
					<div id="js-aboutme">Hust Cser / Android Coder      zuliangwang@hustunique.com  329851721@qq.com</div>
				</section>
				
			</div>
		</div>
	</header>				
</div>
    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  	<div class="overlay">
  		<div class="slider-trigger"></div>
  		<h1 class="header-author js-mobile-header hide">王祖亮</h1>
  	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
				<img lazy-src="/img/touxiang.jpg" class="js-avatar">
			</div>
			<hgroup>
			  <h1 class="header-author">王祖亮</h1>
			</hgroup>
			
			<p class="header-subtitle">一只码畜</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">所有文章</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="https://github.com/ZuLiangWang" title="github">github</a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>
      <div class="body-wrap"><article id="post-Binder机制学习" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/12/04/Binder机制学习/" class="article-date">
  	<time datetime="2016-12-04T06:14:20.000Z" itemprop="datePublished">2016-12-04</time>
</a>
    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      Binder机制学习
    </h1>
  

      </header>
      
      <div class="article-info article-info-post">
        
	<div class="article-tag tagcloud">
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Android/">Android</a></li></ul>
	</div>

        

        <div class="clearfix"></div>
      </div>
      
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>1.What&#xFF1F;</p>
<p>Binder&#x662F;&#x4EC0;&#x4E48;&#xFF1F;Binder&#x662F;Android&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x8BAF;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5E73;&#x65F6;&#x5F00;&#x53D1;App&#x4E00;&#x822C;&#x4E0D;&#x6D89;&#x53CA;&#x5230;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x5F00;&#x53D1;&#x8005;&#x4E86;&#x89E3;&#x6BD4;&#x8F83;&#x5C11;&#xFF0C;&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x6765;&#x5B66;&#x4E60;&#x4E00;&#x4E0B;Binder&#x673A;&#x5236;&#x3002;</p>
<p>&#x5148;&#x6765;&#x770B;Google&#x7ED9;Binder&#x7C7B;&#x7684;&#x63CF;&#x8FF0;&#xFF1A;</p>
<blockquote>
<p>Base class for a remotable object, the core part of a lightweight remote procedure call mechanism defined by <code>IBinder</code>. This class is an implementation of IBinder that provides standard local implementation of such an object.</p>
<p>Most developers will not implement this class directly, instead using the <a href="https://developer.android.com/guide/components/aidl.html" target="_blank" rel="external">aidl</a> tool to describe the desired interface, having it generate the appropriate Binder subclass. You can, however, derive directly from Binder to implement your own custom RPC protocol or simply instantiate a raw Binder object directly to use as a token that can be shared across processes.</p>
<p>This class is just a basic IPC primitive; it has no impact on an application&#x2019;s lifecycle, and is valid only as long as the process that created it continues to run. To use this correctly, you must be doing so within the context of a top-level application component (a <code>Service</code>, <code>Activity</code>, or <code>ContentProvider</code>) that lets the system know your process should remain running.</p>
<p>You must keep in mind the situations in which your process could go away, and thus require that you later re-create a new Binder and re-attach it when the process starts again. For example, if you are using this within an <code>Activity</code>, your activity&#x2019;s process may be killed any time the activity is not started; if the activity is later re-created you will need to create a new Binder and hand it back to the correct place again; you need to be aware that your process may be started for another reason (for example to receive a broadcast) that will not involve re-creating the activity and thus run its code to create a new Binder.</p>
</blockquote>
<p>Binder&#x662F;&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#x7684;&#x57FA;&#x7C7B;&#xFF0C;&#x5B83;&#x7684;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#xFF1A;&#x8F7B;&#x91CF;&#x7EA7;&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x94FE;&#x7531;IBinder&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x662F;IBinder&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x63D0;&#x4F9B;&#x6807;&#x51C6;&#x672C;&#x5730;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x5927;&#x90E8;&#x5206;&#x5F00;&#x53D1;&#x8005;&#x4E0D;&#x9700;&#x8981;&#x76F4;&#x63A5;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x7C7B;&#xFF0C;&#x4F5C;&#x4E3A;&#x4EE3;&#x66FF;&#x4F7F;&#x7528;AIDL&#x5DE5;&#x5177;&#x6765;&#x63CF;&#x8FF0;&#x60F3;&#x8981;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x751F;&#x6210;&#x5408;&#x9002;&#x7684;Binder&#x7684;&#x5B50;&#x7C7B;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4ECE;Binder&#x83B7;&#x5F97;&#x5B9E;&#x73B0;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x534F;&#x8BAE;&#x6216;&#x8005;&#x662F;&#x7B80;&#x5355;&#x7684;&#x53D6;&#x5F97;&#x4E00;&#x4E2A;Binder&#x5B9E;&#x4F8B;&#x6765;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x88AB;&#x8DE8;&#x8FDB;&#x7A0B;&#x5171;&#x4EAB;&#x7684;&#x6807;&#x8BB0;&#x6765;&#x4F7F;&#x7528;&#x3002;</p>
<p>Binder&#x8FD9;&#x4E2A;&#x7C7B;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x539F;&#x59CB;&#x7684;IPC&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x5BF9;App&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x6CA1;&#x6709;&#x5F71;&#x54CD;&#xFF0C;&#x5B83;&#x4ECE;&#x8FDB;&#x7A0B;&#x521B;&#x5EFA;&#x5E76;&#x8FD0;&#x884C;&#x5B83;&#x8D77;&#x624D;&#x5F00;&#x59CB;&#x751F;&#x6548;&#x3002;&#x4E3A;&#x4E86;&#x6B63;&#x786E;&#x7684;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x8981;&#x5728;&#x9876;&#x5C42;App&#x7EC4;&#x4EF6;&#x73AF;&#x5883;&#x91CC;&#x4F7F;&#x7528;&#x6765;&#x8BA9;&#x7CFB;&#x7EDF;&#x77E5;&#x9053;&#x4F60;&#x7684;&#x8FDB;&#x7A0B;&#x5E94;&#x8BE5;&#x4FDD;&#x6301;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x4F60;&#x4E00;&#x5B9A;&#x8981;&#x8BB0;&#x4F4F;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x4F60;&#x7684;&#x8FDB;&#x7A0B;&#x4F1A;go away&#xFF0C;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x4F60;&#x5728;&#x4E4B;&#x540E;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;Binder&#x5E76;&#x4E14;&#x91CD;&#x65B0;attach&#x5B83;&#x5F53;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x518D;&#x6B21;&#x542F;&#x52A8;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;Activity&#x91CC;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x5F53;&#x8FD9;&#x4E2A;activity&#x6CA1;&#x6709;&#x542F;&#x52A8;&#x65F6;&#xFF0C;&#x4F60;&#x7684;activity&#x6240;&#x5728;&#x7684;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x88AB;&#x6740;&#x6389;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;activity&#x4E4B;&#x540E;&#x88AB;&#x91CD;&#x5EFA;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;Binder&#x5E76;&#x628A;&#x5B83;&#x653E;&#x5230;&#x6B63;&#x786E;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F60;&#x8981;&#x6CE8;&#x610F;&#x4F60;&#x7684;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x5176;&#x5B83;&#x7684;&#x539F;&#x56E0;&#x800C;&#x542F;&#x52A8;&#xFF08;&#x4F8B;&#x5982;&#x63A5;&#x6536;&#x5E7F;&#x64AD;&#xFF09;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x4F1A;&#x91CD;&#x65B0;&#x521B;&#x5EFA;activity&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x4F60;&#x6765;&#x81EA;&#x5DF1;&#x5904;&#x7406;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;Binder&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x6BB5;&#x8BF4;&#x4E86;&#x4E9B;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x7B80;&#x5355;&#x7684;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF1A;</p>
<blockquote>
<p>Binder&#x7C7B;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;IPC&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x7684;&#x903B;&#x8F91;&#xFF0C;Binder&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x95F4;&#x5171;&#x4EAB;&#x7684;&#x53D8;&#x91CF;&#x6765;&#x4F7F;&#x7528;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x4E00;&#x5957;&#x590D;&#x6742;&#x7684;&#x534F;&#x8BAE;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x5B83;&#x3002;&#x4F5C;&#x4E3A;App&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;AIDL&#x5DE5;&#x5177;&#x6765;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x751F;&#x6210;Binder&#x3002;</p>
<p>&#x4F7F;&#x7528;Binder&#x65F6;&#x8981;&#x6CE8;&#x610F;&#x8FDB;&#x7A0B;&#x7684;&#x53D8;&#x5316;&#x60C5;&#x51B5;&#x548C;Binder&#x6240;&#x5728;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x8FDB;&#x7A0B;&#x6709;&#x53EF;&#x80FD;&#x610F;&#x5916;&#x88AB;&#x6740;&#x6B7B;&#x6216;&#x8005;&#x5524;&#x8D77;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x4F60;&#x53BB;&#x505A;&#x5BF9;&#x5E94;&#x7684;&#x5904;&#x7406;&#x3002;</p>
</blockquote>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6765;&#x770B;&#x770B;IBinder&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x63CF;&#x8FF0;&#xFF1A;</p>
<blockquote>
<p>Base interface for a remotable object, the core part of a lightweight remote procedure call mechanism designed for high performance when performing in-process and cross-process calls. This interface describes the abstract protocol for interacting with a remotable object. Do not implement this interface directly, instead extend from <code>Binder</code>.</p>
<p>The key IBinder API is <code>transact()</code> matched by <code>Binder.onTransact()</code>. These methods allow you to send a call to an IBinder object and receive a call coming in to a Binder object, respectively. This transaction API is synchronous, such that a call to <code>transact()</code> does not return until the target has returned from <code>Binder.onTransact()</code>; this is the expected behavior when calling an object that exists in the local process, and the underlying inter-process communication (IPC) mechanism ensures that these same semantics apply when going across processes.</p>
<p>The data sent through transact() is a <code>Parcel</code>, a generic buffer of data that also maintains some meta-data about its contents. The meta data is used to manage IBinder object references in the buffer, so that those references can be maintained as the buffer moves across processes. This mechanism ensures that when an IBinder is written into a Parcel and sent to another process, if that other process sends a reference to that same IBinder back to the original process, then the original process will receive the same IBinder object back. These semantics allow IBinder/Binder objects to be used as a unique identity (to serve as a token or for other purposes) that can be managed across processes.</p>
<p>The system maintains a pool of transaction threads in each process that it runs in. These threads are used to dispatch all IPCs coming in from other processes. For example, when an IPC is made from process A to process B, the calling thread in A blocks in transact() as it sends the transaction to process B. The next available pool thread in B receives the incoming transaction, calls Binder.onTransact() on the target object, and replies with the result Parcel. Upon receiving its result, the thread in process A returns to allow its execution to continue. In effect, other processes appear to use as additional threads that you did not create executing in your own process.</p>
<p>The Binder system also supports recursion across processes. For example if process A performs a transaction to process B, and process B while handling that transaction calls transact() on an IBinder that is implemented in A, then the thread in A that is currently waiting for the original transaction to finish will take care of calling Binder.onTransact() on the object being called by B. This ensures that the recursion semantics when calling remote binder object are the same as when calling local objects.</p>
<p>When working with remote objects, you often want to find out when they are no longer valid. There are three ways this can be determined:</p>
<ul>
<li>The <code>transact()</code> method will throw a <code>RemoteException</code> exception if you try to call it on an IBinder whose process no longer exists.</li>
<li>The <code>pingBinder()</code> method can be called, and will return false if the remote process no longer exists.</li>
<li>The <code>linkToDeath()</code> method can be used to register a <code>IBinder.DeathRecipient</code> with the IBinder, which will be called when its containing process goes away.</li>
</ul>
</blockquote>
<p>IBinder&#x662F;&#x4E3A;&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x7684;&#x57FA;&#x672C;&#x63A5;&#x53E3;&#xFF0C;&#x5B83;&#x662F;&#x9AD8;&#x6548;&#x6267;&#x884C;&#x8FDB;&#x7A0B;&#x95F4;&#x548C;&#x8DE8;&#x8FDB;&#x7A0B;&#x8C03;&#x7528;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x8FDC;&#x7A0B;&#x8C03;&#x7528;&#x673A;&#x5236;&#x7684;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#x3002;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#x63CF;&#x8FF0;&#x4E86;&#x4E0E;&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#x4EA4;&#x4E92;&#x7684;&#x62BD;&#x8C61;&#x534F;&#x8BAE;&#x3002;&#x4E0D;&#x8981;&#x76F4;&#x63A5;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x7EE7;&#x627F;Binder&#x6765;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p>
<p>IBinder&#x7684;&#x5173;&#x952E;API&#x662F;&#x548C;<code>Binder.onTransact</code>&#x5339;&#x914D;&#x7684;<code>transact</code>&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x5206;&#x522B;&#x5141;&#x8BB8;&#x4F60;&#x4F20;&#x9012;&#x4E00;&#x4E2A;&#x8C03;&#x7528;&#x7ED9;IBinder&#x5BF9;&#x8C61;&#x548C;&#x63A5;&#x53D7;&#x6765;&#x81EA;Binder&#x5BF9;&#x8C61;&#x7684;&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x4FE9;&#x65B9;&#x6CD5;&#x90FD;&#x662F;&#x540C;&#x6B65;&#x7684;&#xFF0C;&#x5373;&#x4E00;&#x76F4;&#x5835;&#x585E;&#x76F4;&#x5230;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#xFF0C;</p>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/12/11/PopupWindow和Dialog/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption"><</strong>
      <div class="article-nav-title">
        
          PopupWindow和Dialog
        
      </div>
    </a>
  
  
    <a href="/2016/11/29/SystemService学习记录/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">SystemServe学习记录</div>
      <strong class="article-nav-caption">></strong>
    </a>
  
</nav>

  
</article>


<div class="share">
	<!-- JiaThis Button BEGIN -->
	<div class="jiathis_style">
		<span class="jiathis_txt">分享到：</span>
		<a class="jiathis_button_tsina"></a>
		<a class="jiathis_button_cqq"></a>
		<a class="jiathis_button_douban"></a>
		<a class="jiathis_button_weixin"></a>
		<a class="jiathis_button_tumblr"></a>
		<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	</div>
	<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js?uid=1405949716054953" charset="utf-8"></script>
	<!-- JiaThis Button END -->
</div>



<div class="duoshuo">
	<!-- 多说评论框 start -->
	<div class="ds-thread" data-thread-key="Binder机制学习" data-title="Binder机制学习" data-url="http://yoursite.com/2016/12/04/Binder机制学习/"></div>
	<!-- 多说评论框 end -->
	<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
	<script type="text/javascript">
	var duoshuoQuery = {short_name:"true"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		 || document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
	<!-- 多说公共JS代码 end -->
</div>




</div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2017 王祖亮
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten
      	</div>
    </div>
  </div>
</footer>
    </div>
    
  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css" type="text/css">


<script>
	var yiliaConfig = {
		fancybox: true,
		mathjax: true,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false
	}
</script>
<script src="http://7.url.cn/edu/jslib/comb/require-2.1.6,jquery-1.9.1.min.js" type="text/javascript"></script>
<script src="/js/main.js" type="text/javascript"></script>






<script type="text/x-mathjax-config">
MathJax.Hub.Config({
    tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
    }
});

MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';                 
    }       
});
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>


  </div>
</body>
</html>